app/controllers/application_controller.rb

    def current_user
        if decoded_token
            user_id = decoded_token[0]['user_id']
            puts user_id
            @user = User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1