app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT `users`.* FROM `users`

    def show
        begin
            @user = User.find(params[:id])
            records = Record.where(user_id: @user.id).order(created_at: :desc).limit(7)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `records`.* FROM `records` WHERE `records`.`user_id` = 2 ORDER BY `records`.`created_at` DESC LIMIT 7

    def destroy
            @user = User.find(params[:id])
            @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1

    def create
        @user = User.new(user_params)
        @user.health = 100
        @user.status =  "healthy"
        @user.currency = 0
        if @user.save
---
INSERT INTO `users` (`username`, `password`, `health`, `currency`, `created_at`, `updated_at`) VALUES ('jo an', 'hello', 100, 0, '2024-04-06 07:48:49.975891', '2024-04-06 07:48:49.975891')

    def login
        @user = User.find_by(username: params[:user][:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'jonatadsfasdfhan' LIMIT 1